HELYXcore-4.4.0/examples/legacy/multiphase/driftFluxFoam/RAS/tank3D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    SYMP3
    {
        type            slip;
    }

    INLE1
    {
        type            calculated;
        value           $internalField;
    }

    "OUTL.*"
    {
        type            calculated;
        value           $internalField;
    }

    "WALL.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
